fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <comment>Формирует реализации по всем действующим договорам абонентского обслуживания за выбранный месяц.</comment>
  <attributes>
    <name>Период</name>
    <comment>Любая дата месяца, за который формируются акты.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		Объект.Период = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАкты(Команда)
	
	Если Объект.Договоры.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Сначала заполните список договоров.'"));
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЗапуститьСозданиеАктов();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("СозданиеАктовЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет табличную часть действующими договорами абонентского обслуживания
// и уже созданными за месяц реализациями.
//
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Договоры = Обработки.ВКМ_МассовоеСозданиеАктов.ДействующиеДоговоры(Объект.Период);
	
	Объект.Договоры.Очистить();
	
	Для Каждого СтрокаДоговора Из Договоры Цикл
		НоваяСтрока = Объект.Договоры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДоговора);
		Если ЗначениеЗаполнено(СтрокаДоговора.Реализация) Тогда
			НоваяСтрока.Результат = НСтр("ru = 'Реализация за месяц уже создана'");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Запускает создание актов в фоновом задании.
//
// Возвращаемое значение:
//  Структура - см. ДлительныеОперации.ВыполнитьВФоне.
//
&НаСервере
Функция ЗапуститьСозданиеАктов()
	
	МассивДоговоров = Новый Массив;
	Для Каждого СтрокаДоговора Из Объект.Договоры Цикл
		МассивДоговоров.Добавить(СтрокаДоговора.Договор);
	КонецЦикла;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Период", Объект.Период);
	ПараметрыМетода.Вставить("Договоры", МассивДоговоров);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Массовое создание актов'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьАктыВФоне",
		ПараметрыМетода,
		ПараметрыВыполнения);
	
КонецФункции

// Обработчик завершения длительной операции.
//
// Параметры:
//  Результат              - Структура, Неопределено - см. ДлительныеОперацииКлиент.ОжидатьЗавершение.
//  ДополнительныеПараметры - Произвольный - не используется.
//
&НаКлиенте
Процедура СозданиеАктовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ОтобразитьРезультат(Результат.АдресРезультата);
	
КонецПроцедуры

// Переносит результат фонового задания в табличную часть.
//
// Параметры:
//  АдресРезультата - Строка - адрес результата во временном хранилище.
//
&НаСервере
Процедура ОтобразитьРезультат(АдресРезультата)
	
	ТаблицаРезультата = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(ТаблицаРезультата) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаРезультата Из ТаблицаРезультата Цикл
		НайденныеСтроки = Объект.Договоры.НайтиСтроки(
			Новый Структура("Договор", СтрокаРезультата.Договор));
		Для Каждого СтрокаТабличнойЧасти Из НайденныеСтроки Цикл
			СтрокаТабличнойЧасти.Реализация = СтрокаРезультата.Реализация;
			СтрокаТабличнойЧасти.Результат = СтрокаРезультата.Результат;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
